; domain
(define (domain cleaning)
  (:requirements :strips :typing)
  
  (:types location)
  
  (:predicates
    (at ?l - location)
    (dirty ?l - location)
    (swept ?l - location)
    (mopped ?l - location)
    (has-trash ?l - location)
    (carrying-trash)
    (adjacent ?l1 ?l2 - location)
  )
  
  (:action move
    :parameters (?from ?to - location)
    :precondition (and (at ?from) (adjacent ?from ?to))
    :effect (and (not (at ?from)) (at ?to))
  )
  
  (:action sweep
    :parameters (?l - location)
    :precondition (and (at ?l) (dirty ?l))
    :effect (and (not (dirty ?l)) (swept ?l))
  )
  
  (:action mop
    :parameters (?l - location)
    :precondition (and (at ?l) (swept ?l))
    :effect (and (not (swept ?l)) (mopped ?l))
  )
  
  (:action pick-trash
    :parameters (?l - location)
    :precondition (and (at ?l) (has-trash ?l) (not (carrying-trash)))
    :effect (and (not (has-trash ?l)) (carrying-trash))
  )
  
  (:action drop-trash
    :parameters ()
    :precondition (and (at dustbin) (carrying-trash))
    :effect (not (carrying-trash))
  )
)

; problem
(define (problem cleaning_problem)
  (:domain cleaning)
  
  (:objects
    classroom cafeteria dustbin - location
  )
  
  (:init
    (at classroom)
    (dirty classroom)
    (dirty cafeteria)
    (has-trash classroom)
    (has-trash cafeteria)
    (adjacent classroom cafeteria)
    (adjacent cafeteria classroom)
    (adjacent cafeteria dustbin)
    (adjacent dustbin cafeteria)
  )
  
  (:goal
    (and
      (mopped classroom)
      (mopped cafeteria)
      (not (carrying-trash))
      (not (has-trash classroom))
      (not (has-trash cafeteria))
    )
  )
)

; plan
1. (pick-trash classroom)
   deleted: (has-trash classroom)
   added: (carrying-trash)
   goals met: 1 of 5
2. (sweep classroom)
   deleted: (dirty classroom)
   added: (swept classroom)
   goals met: 1 of 5
3. (mop classroom)
   deleted: (swept classroom)
   added: (mopped classroom)
   goals met: 2 of 5
4. (move classroom cafeteria)
   deleted: (at classroom)
   added: (at cafeteria)
   goals met: 2 of 5
5. (sweep cafeteria)
   deleted: (dirty cafeteria)
   added: (swept cafeteria)
   goals met: 2 of 5
6. (mop cafeteria)
   deleted: (swept cafeteria)
   added: (mopped cafeteria)
   goals met: 3 of 5
7. (move cafeteria dustbin)
   deleted: (at cafeteria)
   added: (at dustbin)
   goals met: 3 of 5
8. (drop-trash)
   deleted: (carrying-trash)
   goals met: 4 of 5
9. (move dustbin cafeteria)
   deleted: (at dustbin)
   added: (at cafeteria)
   goals met: 4 of 5
10. (pick-trash cafeteria)
   deleted: (has-trash cafeteria)
   added: (carrying-trash)
   goals met: 4 of 5
11. (move cafeteria dustbin)
   deleted: (at cafeteria)
   added: (at dustbin)
   goals met: 4 of 5
12. (drop-trash)
   deleted: (carrying-trash)
   goals met: 5 of 5
